
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:zaijian/com/yestoday/widget/ZJ_AppBar.dart';

/**
 * 从服务器加载关于再见的介绍信息，缓存到本地
 */
class AboutZaiJianPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: ZJ_AppBar("关于再见"),
      body:Container(
        padding:EdgeInsets.all(10.0),
        child: SingleChildScrollView(
          child:
            Text("再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员"
                "再见app是一款回忆管理工具,用户帮助大家存储关键性回忆，自动分享到相关人员")
        )
      )
    );
  }

}